Revit 2027 API
TextBoxData Constructor
Constructs a new instance of TextBoxData.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TextBoxData(
	string name
)
Public Sub New (
	name As String
)
public:
TextBoxData(
	String^ name
)
new :
        name : string -> TextBoxData
Parameters
name String
The internal name of the TextBoxData.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is passed for name.
ArgumentException | Thrown when an empty string is passed for name.
See Also
Reference
TextBoxData Class
Autodesk.Revit.UI Namespace